In [2]:
import numpy as np
import pandas as pd

# GroupBy

In [3]:
data = {'Sede':['SP','SP','MG','MG','RJ','RJ','ES','ES'],
       'Vendedor':['Jorge','Ana','Tiago','Pedro','Raphaela','Guto','Maria','Carolina'],
       'Vendas':[2000,2500,3100,1200,1500,3900,2900,3900]}
df = pd.DataFrame(data)

In [4]:
arrays = [['São Paulo', 'São Paulo', 'Rio de Janeiro', 'Rio de Janeiro','Minas Gerais','Minas Gerais'],
['Garrafas','Copos','Garrafas','Copos','Garrafas','Copos' ]]
index = pd.MultiIndex.from_arrays(arrays, names=('Estado', 'Produto'))
df1 = pd.DataFrame({'Total Vendido R$': [10000, 35000, 22400, 12890,10880,13900]},index=index)

In [5]:
df

  Sede  Vendedor  Vendas
0   SP     Jorge    2000
1   SP       Ana    2500
2   MG     Tiago    3100
3   MG     Pedro    1200
4   RJ  Raphaela    1500
5   RJ      Guto    3900
6   ES     Maria    2900
7   ES  Carolina    3900

In [6]:
df.groupby('Sede')

In [7]:
by_sede = df.groupby('Sede')

In [8]:
by_sede # groupby não cria uma visualização

In [9]:
by_sede.max()

      Vendedor  Vendas
Sede
ES       Maria    3900
MG       Tiago    3100
RJ    Raphaela    3900
SP       Jorge    2500

In [10]:
by_sede.mean()

      Vendas
Sede
ES      3400
MG      2150
RJ      2700
SP      2250

In [11]:
by_sede.describe()

     Vendas
      count    mean          std     min     25%     50%     75%     max
Sede
ES      2.0  3400.0   707.106781  2900.0  3150.0  3400.0  3650.0  3900.0
MG      2.0  2150.0  1343.502884  1200.0  1675.0  2150.0  2625.0  3100.0
RJ      2.0  2700.0  1697.056275  1500.0  2100.0  2700.0  3300.0  3900.0
SP      2.0  2250.0   353.553391  2000.0  2125.0  2250.0  2375.0  2500.0

In [12]:
by_sede.describe().transpose()

Sede                   ES           MG           RJ           SP
Vendas count     2.000000     2.000000     2.000000     2.000000
       mean   3400.000000  2150.000000  2700.000000  2250.000000
       std     707.106781  1343.502884  1697.056275   353.553391
       min    2900.000000  1200.000000  1500.000000  2000.000000
       25%    3150.000000  1675.000000  2100.000000  2125.000000
       50%    3400.000000  2150.000000  2700.000000  2250.000000
       75%    3650.000000  2625.000000  3300.000000  2375.000000
       max    3900.000000  3100.000000  3900.000000  2500.000000

In [13]:
by_sede.describe().transpose()['SP']

Vendas  count       2.000000
        mean     2250.000000
        std       353.553391
        min      2000.000000
        25%      2125.000000
        50%      2250.000000
        75%      2375.000000
        max      2500.000000
Name: SP, dtype: float64

E em um dataframe multiindex?

In [14]:
df1

                         Total Vendido R$
Estado         Produto
São Paulo      Garrafas             10000
               Copos                35000
Rio de Janeiro Garrafas             22400
               Copos                12890
Minas Gerais   Garrafas             10880
               Copos                13900

In [16]:
mult_bysede = df1.groupby('Estado',level=0)

In [17]:
mult_bysede

In [18]:
mult_bysede.max()

                Total Vendido R$
Estado
Minas Gerais               13900
Rio de Janeiro             22400
São Paulo                  35000

In [19]:
mult_byprod = df1.groupby('Produto',level=1)

In [20]:
mult_byprod

In [21]:
mult_byprod.describe()

         Total Vendido R$                                                \
                    count          mean           std      min      25%
Produto
Copos                 3.0  20596.666667  12483.870927  12890.0  13395.0
Garrafas              3.0  14426.666667   6919.113623  10000.0  10440.0


              50%      75%      max
Produto
Copos     13900.0  24450.0  35000.0
Garrafas  10880.0  16640.0  22400.0